https://help.github.com/articles/using-pull-requests/

http://pcottle.github.io/learnGitBranching/


Внимание! Все задания, начиная с этого урока, нужно выполнять в отдельных ветках и сдавать через pull requests, публикуя ссылку на него в качестве ответа.

Создать ветку, реализовать в ней следюущий функционал:

    Возможность управления вагонами (добавление/удаление/изменение)
     - При добавлении вагона указывается поезд, к которому он добавляется, а также:
     - Тип вагона (купейный/плацкартный)
     - Кол-во мест: верхних/нижних
    При просмотре поезда, также должна отображаться следующая информация:
     - Кол-во плацкартный/купейных вагонов в составе поезда
     - Кол-во мест: плацкартных верхних/нижних, купейных верхних/нижних


    Залить ветку на github
    Создать pull request и опубликовать ссылку на него в качестве ответа на задание
    Слить изменения в master только после того, как задание будет принято.
